## Staging: eks
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 3 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lb_listener_rule.alt-domain-document-api-host-route[0] will be created
  + resource "aws_lb_listener_rule" "alt-domain-document-api-host-route" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c"
      + priority     = 10
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "api.document.staging.notification.cdssandbox.xyz"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "api.document.staging.notification.cdssandbox.xyz",
                ]
            }
        }
    }

  # aws_lb_listener_rule.alt-domain-document-host-route[0] will be created
  + resource "aws_lb_listener_rule" "alt-domain-document-host-route" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c"
      + priority     = 20
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "document.staging.notification.cdssandbox.xyz"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "document.staging.notification.cdssandbox.xyz",
                ]
            }
        }
    }

  # aws_lb_listener_rule.alt-domain-host-route[0] will be created
  + resource "aws_lb_listener_rule" "alt-domain-host-route" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c"
      + priority     = 40
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "staging.notification.cdssandbox.xyz"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "staging.notification.cdssandbox.xyz",
                ]
            }
        }
    }

  # aws_wafv2_web_acl.notification-canada-ca will be updated in-place
  ~ resource "aws_wafv2_web_acl" "notification-canada-ca" {
        id         = "d7f2eabc-ee4e-4c8d-b262-97f5370b5555"
        name       = "notification-canada-ca-waf"
        tags       = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (5 unchanged attributes hidden)


      - rule {
          - name     = "document_download_invalid_path" -> null
          - priority = 10 -> null

          - action {

              - block {
                  - custom_response {
                      - response_code = 204 -> null
                    }
                }
            }

          - statement {
              - and_statement {
                  - statement {

                      - byte_match_statement {
                          - positional_constraint = "STARTS_WITH" -> null
                          - search_string         = "api.document" -> null

                          - field_to_match {

                              - single_header {
                                  - name = "host" -> null
                                }
                            }

                          - text_transformation {
                              - priority = 1 -> null
                              - type     = "COMPRESS_WHITE_SPACE" -> null
                            }
                          - text_transformation {
                              - priority = 2 -> null
                              - type     = "LOWERCASE" -> null
                            }
                        }
                    }
                  - statement {

                      - not_statement {
                          - statement {

                              - regex_pattern_set_reference_statement {
                                  - arn = "arn:aws:wafv2:ca-central-1:239043911459:regional/regexpatternset/re_document_download/16c61e77-fe42-4f0c-a46b-b896430771f5" -> null

                                  - field_to_match {

                                      - uri_path {}
                                    }

                                  - text_transformation {
                                      - priority = 1 -> null
                                      - type     = "COMPRESS_WHITE_SPACE" -> null
                                    }
                                  - text_transformation {
                                      - priority = 2 -> null
                                      - type     = "LOWERCASE" -> null
                                    }
                                }
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "document_download_api_invalid_path" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "SigninRateLimitRule" -> null
          - priority = 7 -> null

          - action {

              - block {
                  - custom_response {
                      - response_code = 429 -> null

                      - response_header {
                          - name  = "waf-block" -> null
                          - value = "RateLimitRestriction" -> null
                        }
                    }
                }
            }

          - statement {

              - rate_based_statement {
                  - aggregate_key_type = "IP" -> null
                  - limit              = 100 -> null

                  - scope_down_statement {

                      - or_statement {
                          - statement {

                              - byte_match_statement {
                                  - positional_constraint = "STARTS_WITH" -> null
                                  - search_string         = "/sign-in" -> null

                                  - field_to_match {

                                      - uri_path {}
                                    }

                                  - text_transformation {
                                      - priority = 0 -> null
                                      - type     = "LOWERCASE" -> null
                                    }
                                }
                            }
                          - statement {

                              - byte_match_statement {
                                  - positional_constraint = "STARTS_WITH" -> null
                                  - search_string         = "/register" -> null

                                  - field_to_match {

                                      - uri_path {}
                                    }

                                  - text_transformation {
                                      - priority = 1 -> null
                                      - type     = "LOWERCASE" -> null
                                    }
                                }
                            }
                          - statement {

                              - byte_match_statement {
                                  - positional_constraint = "STARTS_WITH" -> null
                                  - search_string         = "/forgot-password" -> null

                                  - field_to_match {

                                      - uri_path {}
                                    }

                                  - text_transformation {
                                      - priority = 2 -> null
                                      - type     = "LOWERCASE" -> null
                                    }
                                }
                            }
                          - statement {

                              - byte_match_statement {
                                  - positional_constraint = "STARTS_WITH" -> null
                                  - search_string         = "/forced-password-reset" -> null

                                  - field_to_match {

                                      - uri_path {}
                                    }

                                  - text_transformation {
                                      - priority = 2 -> null
                                      - type     = "LOWERCASE" -> null
                                    }
                                }
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "SigninRule" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "document_download_invalid_path"
          + priority = 10

          + action {

              + block {
                  + custom_response {
                      + response_code = 204
                    }
                }
            }

          + statement {
              + and_statement {
                  + statement {

                      + byte_match_statement {
                          + positional_constraint = "STARTS_WITH"
                          + search_string         = "api.document"

                          + field_to_match {

                              + single_header {
                                  + name = "host"
                                }
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 2
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                  + statement {

                      + not_statement {
                          + statement {

                              + regex_pattern_set_reference_statement {
                                  + arn = "arn:aws:wafv2:ca-central-1:239043911459:regional/regexpatternset/re_document_download/16c61e77-fe42-4f0c-a46b-b896430771f5"

                                  + field_to_match {

                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 1
                                      + type     = "COMPRESS_WHITE_SPACE"
                                    }
                                  + text_transformation {
                                      + priority = 2
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "document_download_api_invalid_path"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "SigninRateLimitRule"
          + priority = 7

          + action {

              + block {
                  + custom_response {
                      + response_code = 429

                      + response_header {
                          + name  = "waf-block"
                          + value = "RateLimitRestriction"
                        }
                    }
                }
            }

          + statement {

              + rate_based_statement {
                  + aggregate_key_type = "IP"
                  + limit              = 100

                  + scope_down_statement {

                      + or_statement {
                          + statement {

                              + byte_match_statement {
                                  + positional_constraint = "STARTS_WITH"
                                  + search_string         = "/sign-in"

                                  + field_to_match {

                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 0
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                          + statement {

                              + byte_match_statement {
                                  + positional_constraint = "STARTS_WITH"
                                  + search_string         = "/register"

                                  + field_to_match {

                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 1
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                          + statement {

                              + byte_match_statement {
                                  + positional_constraint = "STARTS_WITH"
                                  + search_string         = "/forgot-password"

                                  + field_to_match {

                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 2
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                          + statement {

                              + byte_match_statement {
                                  + positional_constraint = "STARTS_WITH"
                                  + search_string         = "/forced-password-reset"

                                  + field_to_match {

                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 2
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "SigninRule"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "admin_invalid_path"
          + priority = 11

          + action {

              + count {
                }
            }

          + statement {
              + and_statement {
                  + statement {

                      + or_statement {
                          + statement {

                              + byte_match_statement {
                                  + positional_constraint = "EXACTLY"
                                  + search_string         = "staging.notification.cdssandbox.xyz"

                                  + field_to_match {

                                      + single_header {
                                          + name = "host"
                                        }
                                    }

                                  + text_transformation {
                                      + priority = 1
                                      + type     = "COMPRESS_WHITE_SPACE"
                                    }
                                  + text_transformation {
                                      + priority = 2
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                          + statement {

                              + byte_match_statement {
                                  + positional_constraint = "EXACTLY"
                                  + search_string         = "staging.notification.cdssandbox.xyz"

                                  + field_to_match {

                                      + single_header {
                                          + name = "host"
                                        }
                                    }

                                  + text_transformation {
                                      + priority = 1
                                      + type     = "COMPRESS_WHITE_SPACE"
                                    }
                                  + text_transformation {
                                      + priority = 2
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                  + statement {

                      + not_statement {
                          + statement {

                              + regex_pattern_set_reference_statement {
                                  + arn = "arn:aws:wafv2:ca-central-1:239043911459:regional/regexpatternset/re_admin/57e4e375-6c1f-493e-b7ac-a6ad440c2499"

                                  + field_to_match {

                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 1
                                      + type     = "COMPRESS_WHITE_SPACE"
                                    }
                                  + text_transformation {
                                      + priority = 2
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                  + statement {

                      + not_statement {
                          + statement {

                              + byte_match_statement {
                                  + positional_constraint = "EXACTLY"
                                  + search_string         = "/"

                                  + field_to_match {

                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 0
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "admin_invalid_path"
              + sampled_requests_enabled   = true
            }
        }

        # (11 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos-detected-load-balancer-critical"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
